Revit 2026 API

# ConduitSizesGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<ConduitSize> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of ConduitSize)
```
```cpp
public:
virtual IEnumerator<ConduitSize^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<ConduitSize>
override GetEnumerator : unit -> IEnumerator<ConduitSize>
```

#### Return Value

IEnumeratorConduitSizeAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

ConduitSizes Class

Autodesk.Revit.DB.Electrical Namespace